# Built In Failures View Position Failures Crop Required Alignment Property

Source: https://www.revitapidocs.com/2026/49bb5cc5-3536-abb0-ab15-c7dc59d670de.htm

---

| Built In Failures View Position Failures Crop Required Alignment Property |
| --- |

Can't move Viewport when its placement is controlled by the assigned View Position.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId CropRequiredAlignment { get; }
```

```
Public Shared ReadOnly Property CropRequiredAlignment As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ CropRequiredAlignment {
	FailureDefinitionId^ get ();
}
```

```
static member CropRequiredAlignment : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ViewPositionFailures Class Autodesk.Revit.DB Namespace